<?php
defined('BASEPATH') OR exit('No direct script access allowed');
require_once('Data.php');

class Tools extends CI_Controller {
	public function index()
	{
        $data = array(
            "menu" => Data::$menu
        );
		$this->load->view('tools/index', $data);
	}

	public function getall(){
		$data = array();
        array_push($data, array(
			'id' => 1, "tools"=>"Bowl",  "caption" => "ถ้วย", "position" => "0 0 20",
			"content" => "<p>ถ้วย เป็นภาชนะก้นลึก สำหรับใส่น้ำหรือของบริโภค ภาชนะที่ใส่อาหารรับประทาน ภาชนะที่ใช้ในครัวเรือน คำว่า “เครื่องถ้วย” หมายถึง เครื่องปั้นดินเผาเคลือบ ภาษาอังกฤษใช้คำว่า เซรามิกส์ (ceramics) ถ้วยกระเบื้อง (Porcelain) เครื่องถ้วยชนิดนี้ต้องเตรียมดินขึ้นเป็นพิเศษ ส่วนผสมของดินประกอบด้วย หินควอตซ์ (หินฟันม้า) ดินเคโอลิน ดินเหนียวขาว (Ball clay) และวัตถุอื่นๆ ตามสัดส่วนที่เหมาะสม เนื้อกระเบื้องจะมีความแข็งแกร่งเป็นพิเศษ นิยมนำไปทำเครื่องฉนวนไฟฟ้า และอุปกรณ์ไฟฟ้า
			<p>ปัจจุบัน คงนิยมถ้วยกระเบื้องแบบเดิม แต่จะมีการผลิตจากพลาสติกหรืออลูมิเนียม แต่ถ้วยกระเบื้องยังคงเป็นที่นิยม หรือผลิตจากโพลิเมอร์ผสมระหว่างเมลามีนกับฟอร์มอลดีไฮด์ นิยมนำมาใช้ผลิตบรรจุภัณฑ์ อาหาร ซึ่งพบเห็นได้ทั่วไปในชีวิตประจำวัน เพราะทนความร้อนได้สูง จึงเหมาะสำหรับร้านอาหาร โรงแรม หรือรีสอร์ท 
			"
        ));
        array_push($data, array(
			'id' => 2, "tools"=>"Dipper",  "caption" => "กระบวย", "position" => "0 0 15",
			"content" => "<p>กระบวย เป็นภาชนะตักน้ำทำด้วยกะลามีด้ามถือ ในสมัยก่อนตามหน้าบ้านของชาวชนบท มักจะตั้งซุ้มโอ่งน้ำหรือโอ่งน้ำเย็น ใครเดินผ่านก็จะแวะดื่มน้ำ ทำจากกะลามะพร้าวเสียเป็นส่วนมาก เพราะหาง่ายในท้องถิ่น กระบวยตักน้ำในจังหวัดนครศรีธรรมราชส่วนใหญ่ทำมาจากกะลามะพร้าวและใบของต้นจาก หรือใช้เป็นกระบวยตักแกง หรือถ้าไม่ใช้กะลา จะใช้ตอกสานเป็นรูปกระบวยแล้วยาด้วยชันก็ใช้ตักน้ำดื่มได้ 
			<p> ปัจจุบัน ผลิตจากพลาสติก ตักน้ำกินน้ำใช้ ประยุกต์ดัดเเปลงจากกะลามะพร้าว หลีกเลี่ยงการเกิดเชื้อราได้ สีสันสวยงาม น้ำหนักเบาไม่ปวดแขน หรือผลิตจากสแตนเลส ขึ้นสนิมยาก สามารถทำความสะอาดได้ง่าย ใช้สำหรับตัก ลวก ต้ม จุ่ม ตักแกง ตักน้ำจิ้ม น้ำซุป สุกี้ เป็นต้น หรือใช้ในการตวงของเหลว 
			"
        ));
		array_push($data, array(
			'id' => 3, "tools"=>"Dish",  "caption" => "จาน", "position" => "0 0 20",
			"content" => "<p>จาน หรือเรียกว่า “จานเชิง” หมายถึงภาชนะเครื่องปั้นดินเผาชนิดหนึ่ง มีลักษณะ แบนกลมคล้ายจาน ยกขอบ และมีเชิงอย่างพาน ใช้ใส่อาหาร ใช้จัดสําหรับอาหารอย่างไทย หากเป็นจานขนาดใหญ่ใช้สําหรับใส่ยํา ผัก ปลา รวมทั้งจานข้าวสําหรับรับประทาน แต่ถ้าเป็นจานขนาดเล็กใช้สําหรับใส่กับข้าว และของ หวาน ซึ่งลักษณะจานของไทยนี้ต่างจากจานของทางยุโรป หรือจานที่ใช้ในปัจจุบัน ซึ่งจานหรือจานเชิง ในอดีตมีรูปร่างลักษณะเหมือนพานในปัจจุบัน
			<p>ปัจจุบัน คงนิยมจานกระเบื้องแบบเดิม แต่จะมีการผลิตจากพลาสติกหรืออลูมิเนียม แต่จานกระเบื้องยังคงเป็นที่นิยม หันมานิยมใช้จานเยื่อพืช มีความปลอดภัยและลดโลกร้อน ผลิตด้วยเยื่อพืชธรรมชาติ 100% สะอาด บรรจุอาหารได้ทั้งร้อน-เย็น ทั้งยังสามารถอุ่นอาหารผ่านเตาอบ หรือเตาไมโครเวฟได้โดยปราศจากสารก่อมะเร็ง จึงเป็นมิตรกับสิ่งแวดล้อม เหมาะสำหรับใช้ในงานสังสรรค์ งานปาร์ตี้ และยังเหมาะสำหรับธุรกิจร้านอาหารเคลื่อนที่ ร้านอาหารที่ต้องใช้บรรจุภัณฑ์ที่ต้องการใช้งานชั่วคราว หรือใช้แล้วทิ้ง"
        ));
		array_push($data, array(
			'id' => 4, "tools"=>"GreenPot",  "caption" => "หม้อเคลือบ", "position" => "0 0 20",
			"content" => "<p>หม้อเคลือบ เป็นภาชนะประเภทหนึ่ง มีรูปทรงต่าง ๆ สำหรับใส่ของหรือใช้งานบางอย่าง เรียกตามสิ่งที่ใช้ทำ  เช่น หม้อดิน หม้อทองเหลือง เรียกตามสิ่งที่บรรจุก็มี เช่น หม้อข้าว หม้อน้ำมนต์ เรียกตามวัตถุประสงค์ที่ใช้สอยก็มี เช่น หม้อตุ๋น หม้อนึ่ง อดีตทำจากสังกะสี เคลือบสีต่างๆ มีหูหิ้ว ใช้สำหรับใส่อาหาร ข้าว แกง และสามารถหิ้วไปตามที่ต่างๆ ได้ หม้อเคลือบหรือสังกะสีเคลือบ สมัยโบราณ    ผลิตมาจากเหล็ก
			<p>หม้อเคลือบสมัยปัจจุบัน เคลือบด้วยผงแก้วนำมาผสมสี ซึ่งเป็นสารที่ไม่เป็นอันตรายต่อร่างกาย ระวังอย่าทำหม้อหล่นหรือกระทบกับวัสดุที่มีความแข็งเพราะสีอาจจะกะเทาะได้ และเมื่อผิวด้านนอกกะเทาะแล้วจะเห็นเป็นเนื้อโลหะด้าน จะเป็นช่องทางที่ทำให้บริเวณอื่น ๆ กะเทาะตามจากการเกิดสนิมได้ หรือผลิตจากแสตนเลส และอลูมิเนียม นิยมนำไปประกอบอาหารหรือเป็นภาชนะใส่อาหาร           ซึ่งสะดวกในการเคลื่อนย้าย เพราะมีหูหิ้ว และน้ำหนักเบา 
			"
        ));
		array_push($data, array(
			'id' => 5, "tools"=>"Kanam",  "caption" => "กาน้ำชา", "position" => "0 0 20",
			"content" => "<p>สมัยก่อน กาน้ำชา ผลิตจากวัสดุเหล็กเคลือบสี ทำจากโลหะผสมสังกะสี พรีเมียมถือว่ากระบวน การดี สวยงาม และคงทนที่มีมาตรฐานความปลอดภัยสำหรับบรรจุเครื่องดื่ม เคลือบด้วยผิวอีนาเมล        ที่สามารถตั้งไฟ และใช้กับเตาประกอบอาหารได้ ขอบปากกาน้ำชาทำจากสแตนเลส ใช้ต้ม   ใบชา ต้มน้ำสมุนไพร นำไปจัดวางในบ้านหรือวางในครัว 
			<p>ในปัจจุบัน กาน้ำชาสามารถทำจากวัสดุประเภทต่าง ๆ เช่น พลาสติก, เซรามิก, แก้ว, พอร์ซเลน,   สเตนเลส และเหล็กหล่อเหล็กหล่อ และสเตนเลสสตีล มีความทนทานมากที่สุดแม้ว่าจะมีน้ำหนักค่อนข้างมาก,แก้วและพอร์ซเลน มีสไตล์และเบาแม้ว่าจะค่อนข้างบอบบาง , เซรามิกและพลาสติก แกร่งเป็นทางเลือกที่ดี ทั้งคู่ พวกเขาให้ความทนทานมากมายในขณะเดียวกันก็มีน้ำหนักเบาและมีสไตล์ นิยมใช้ในชีวิตประจำวัน ตกแต่งบ้าน, ปิคนิค, งานเลี้ยงวินเทจ, ร้านชากาแฟแบบโบราณหรือเหมาะเป็น    ของฝาก ของที่ระลึก"
        ));				
		array_push($data, array(
			'id' => 6, "tools"=>"MaiPai",  "caption" => "พายไม้", "position" => "0 10 35",
			"content" => "<p>ช้อนไม้หรือพายไม้ ชนิดต่างๆ ทำจากไม้เนื้อแข็ง เช่น ไม้สัก ไม้โมก ลักษณะรูปร่างเหมือนไม้พายเรือ คือ มีด้ามยาวกลมถือได้ถนัดมือ ช่วงปลายจะแบนบานออกโค้งมนด้านหัวบนสุด พายไม้ขนาดเล็กสำหรับแซะขนมขนาดเล็ก เช่น ขนมถ้วยตะไล ฯลฯ และใช้ในการกวนขนมชนิดต่างๆ เพราะ ทำความสะอาดใช้ล้างด้วยสบู่   ล้างน้ำสะอาดเช็ดให้แห้ง 
			<p>ปัจจุบัน นิยมเปลี่ยนมาใช้ไม้พายซิลิโคน ซึ่งทนร้อนได้ดี ใช้ทำขนม ปาดภาชนะหมดจรด จะใช้ผัดอาหารก็ดีไม่ละลายเหมือนตะหลิวไนล่อน ใช้ในการตะล่อมหรือคลุกเคล้าส่วนผสมต่างๆ ในการทำขนม ใช้ขูดส่วนผสมที่เหลือในภาชนะ สามารถใช้คนอาหารขณะตั้งเตาหรือสามารถใช้ในการผัดหรือทอดเพื่อประกอบอาหาร ซึ่งพายซิลิโคนจะดูแลรักษาและทำความสะอาดง่าย"
        ));        
		array_push($data, array(
			'id' => 7, "tools"=>"Pan",  "caption" => "กระทะทองเหลือง", "position" => "0 10 60",
			"content" => "<p>กระทะทองเหลือง รูปร่างกลมป้อม ก้นลึกกว่ากระทะเหล็ก มีหูสองข้าง เอาไว้ทำขนมโดยเฉพาะเหมาะสำหรับการกวนขนม เช่น กล้วยเชื่อม หรือ ทำขนมขาย ทองเหลืองมีคุณสมบัติให้ความร้อนสม่ำเสมอ ทำให้อาหารออกมาสวย หรือนำมาใช้ประกอบของ
			<p>ปัจจุบันนิยมใช้กระทะทองเหลือง เป็นกระทะแบบมาตรฐาน มีหูจับสองด้าน ผลิตจากทองเหลืองแท้ ทำให้กระจายความร้อนได้ดี นิยมใช้กันมาอย่างช้านาน ไม่สามารถหาวัสดุใดทดแทนได้ นำไปใช้กวนขนมไทยโบราณ เช่น ทองหยิบ ทองหยอด ฝอยทอง เป็นต้น
			"
        ));
		array_push($data, array(
			'id' => 8, "tools"=>"Pinto",  "caption" => "ปิ่นโตเคลือบ", "position" => "0 0 20",
			"content" => "<p>ปิ่นโตเคลือบ ทำจากเหล็กเคลือบด้วยอีนาเมล ซึ่งเป็นวัตถุดิบที่ใช้กับกระทะเทฟล่อน ไม่เป็นอันตรายต่อร่างกาย ให้เลือกใช้เหมาะกับงานประเพณีต่างๆ ปิ่นโตเรียกได้หลายอย่าง เช่น ปิ่นโตสี ปิ่นโตโบราณ ปิ่นโตสีพาสเทล ปิ่นโตเคลือบ ปิ่นโตวัด ปิ่นโตเหลือง ปิ่นโตสังกะสี ปิ่นโตตรากระต่าย ปิ่นโตอีนาเมล ปิ่นโต เป็นภาชนะชนิดหนึ่งสำหรับบรรจุอาหาร ประกอบด้วย ภาชนะรูปทรงกระบอกซ้อนกันเป็นชั้นๆ มีโครงเป็นโลหะ เรียกว่า ขา ร้อยตรงส่วนหูสองข้างหิ้วได้ มักจะมีตั้งแต่ 2 ขึ้นไป เรียกว่า “เถา” ปิ่นโตชั้นล่างสุดจะมีขนาดใหญ่กว่าชั้นอื่นๆ เล็กน้อย นิยมใส่ข้าว ส่วนชั้นอื่นๆ อาจ       ใส่กับข้าว ขนม หรืออื่นๆ นอกจากนี้พุทธศาสนิกชนนิยมบรรจุอาหารใส่ปิ่นโต เพื่อนำไปถวายพระ ตอนเช้า หรือกลางวัน ขณะที่ร้านอาหารที่บริการส่งถึงบ้าน 
			<p>ปัจจุบัน ปิ่นโต ผลิตจากวัสดุเหล็กกล้า ไร้สนิม แข็งแรงทนทาน ปราศจากสารที่เป็นอันตรายต่อสุขภาพ และปิ่นโตที่ผลิตจากพลาสติก คุณภาพเกรดเอ แข็งแรงทนทาน ไร้สารตกค้าง น้ำหนักเบา       ใส่อาหารได้เยอะ ทนความร้อนได้ดี ปิ่นโตนิยมใช้ใส่อาหารสำหรับนักเรียนนำไปรับประทานตอนกลางวัน หรือผู้ที่ทำงานนอกบ้าน  นิยมใช้กันน้อยลงเนื่องจากมีภาชนะรูปแบบอื่นๆ เข้ามาแข่งขันกันมากขึ้น แต่ก็ยังคงอยู่คู่คนไทย เพราะ ปิ่นโตมีคุณสมบัติพิเศษที่ใช้บรรจุอาหารได้เป็นชั้นๆ เหมาะกับอาหารไทยๆ อย่างยิ่ง ทั้งอาหารคาว หวาน อาหารแห้ง น้ำ บรรจุได้ทั้งร้อนและเย็นปลอดภัยไม่มีสารเคมีปนเปื้อนในอาหาร
			"
        ));
		array_push($data, array(
			'id' => 9, "tools"=>"Pot",  "caption" => "หม้อทองเหลือง", "position" => "0 10 60",
			"content" => "<p>  หม้อทองเหลืองโบราณ ในอดีตใช้เป็นสิ่งประดิษฐ์ทางวัฒนธรรม ประเภทเครื่องมือเครื่องใช้ หม้อทองเหลือง มีอายุประมาณ 100 กว่าปี คนสมัยโบราณ นำมาหุงข้าว นึ่งข้าวเหนียว หรือต้ม แกง ได้ตามความต้องการ หม้อทองเหลือง ทำจากเหล็กผสมทองเหลือง มีน้ำหนักพอสมควร 
			<p> ปัจจุบันทำจากอลูมิเนียม หรือสแตนเลส หรือหม้ออัดความดัน เป็นหม้อที่ป้องกันไม่ให้ไอน้ำจากการหุงต้มจากหม้อออกข้างนอกทำให้ข้างในมีความดันของไอน้ำเพิ่มขึ้น อุณหภูมิสูง ใช้ทอดผัดอาหารเป็นอุปกรณ์ที่ใช้ในการอบสมุนไพร เครื่องเทศ และพริก
			"
        ));
		array_push($data, array(
			'id' => 10, "tools"=>"RicePounder",  "caption" => "ครก", "position" => "0 5 20",
			"content" => "ครก เครื่องใช้ทำด้วยไม้ ดินเผา หรือหิน มีลักษณะเป็นหลุมสำหรับตำ หรือโขลกด้วยสาก ขนาดเล็กใหญ่ตามการใช้งา เครื่องใช้ที่มีลักษณะอย่างหลุมสำหรับตำหรือโขลกด้วยสาก เครื่องใช้ที่ทำด้วยหินไม้ท่อดินเผา หรือโลหะ และไม้ท่อนขนาดใหญ่ มีรูปร่างต่างกันไปตามการใช้สอย เป็นเครื่องมือที่ใช้ในการทำมาหากินของชาวเกษตรกรในชนบทไทย อันเกิดจากภูมิปัญญาพื้นบ้านหรือเทคโนโลยีชุมชนที่มีมาตั้งแต่ครัวโบราณกาลที่ชาวนาเริ่มรู้จักปลูกข้าว
			ปัจจุบันนิยมใช้ครกกระเดื่องติดเครื่องจักร นิยมใช้ในกลุ่มผู้ประกอบอาชีพตำข้าวสาร   ครกกระเดื่องติดเครื่องจักร สามารถทำงานได้ยาวนานหลายชั่วโมงต่อเนื่องกัน ช่วยในเรื่องการประหยัดน้ำมัน ช่วยผ่อนแรงในการผลิตสามารถผลิตได้มากขึ้น 
			"
        ));			
		array_push($data, array(
			'id' => 11, "tools"=>"StoneMill",  "caption" => "โม่หิน", "position" => "0 2 8",
			"content" => "<p>เครื่องโม่แป้ง หรือ โม่หิน เครื่องบดชนิดหนึ่งทำด้วยหิน ในสมัยก่อนโม่หินที่ใช้ตามบ้านมักมีขนาดเล็ก ประกอบด้วยตัวครกและฝาครก ตัวครกเป็นทรงกลมฐานเรียบมีแอ่งหรือคลองรอบๆ ให้     น้ำแป้งไหลออกทางปากครกได้ ส่วนกลางเป็นหน้าตัดแซะร่องลึก เรียกว่า ฟันครก นิยมทำจากหินแกรนิตที่มีความแกร่งและน้ำหนักมากโม่หินที่ดีร่องฟันต้องลึกเพียงพอและที่สำคัญแผ่นดินด้านบนและล่างต้องทับกันสนิทจึงจะทำให้เนื้อแป้งที่ละเอียด สมัยก่อนมาจาก 3 วิธีหลัก ได้แก่ การยีและด้วยมือ ตำด้วยครก และโม่ด้วยอุปกรณ์ที่เรียกว่า “โม่หิน”  หรือครกบด การโม่แป้งสดนิยมมากในอาหารว่างและขนมไทย
			<p>ปัจจุบัน เนื่องจากมีแป้งสำเร็จรูปขายตามท้องตลาด ซึ่งหาซื้อได้ง่าย ความจำเป็นในการใช้โม่แป้ง      จึงลดลงไป โม่แป้งจึงค่อยๆ หายไปจากครัวไทยในปัจจุบัน ซึ่งนิยมหันมาใช้เครื่องโม่แป้งไฟฟ้าทดแทน ซึ่งวัสดุผลิตจากเหล็กโครงสร้างหนา และแข็งแรง ส่วนตัวโม่ทำจากเหล็กชุบ หรือผลิตจากสแตนเลส สามารถใช้บดทั้งของเปียกและของแห้ง ใช้โม่งา, โม่น้ำถั่วเหลือง, โม่ข้าวทำขนมจีน, โม่ข้าวทำขนมครก, โม่ข้าวคั่ว ภายในมี  หินบด สามารถปรับความหยาบละเอียดได้  ถ้าโม่เปียกน้ำกับกากจะผสมกัน (ถั่วเหลือง,ข้าวกล้องผ่านการกรองอีกครั้งหนึ่ง) แข็งแรงทนทานต่อการใช้งานหนัก
			"
        ));	
		array_push($data, array(
			'id' => 12, "tools"=>"Thanan",  "caption" => "ทะนาน", "position" => "0 10 70",
			"content" => "<p>กะลามะพร้าวตาเดียว หรือทะนานตักข้าวสาร เป็นวัตถุอาถรรพ์ นำโชค ป้องกันภัย ป้องกันเสนียดจัญไรและ   คุณไสย คนสมัยโบราณมีความเชื่อว่ากะลามะพร้าวที่มีตาเดียว หรือเรียกว่า กะลาตาเดียว เป็นวัตถุที่มีอำนาจอาถรรพ์และคุณวิเศษ นำเปลือกกะลาตาเดียวมาใช้เป็นเครื่องรางของขลัง เพื่อนำมาเจาะ กะลามาร้อยเป็นสร้อยคอ และใช้เป็นภาชนะตักข้าวสารเวลาหุงข้าว 
			<p>ปัจจุบัน นักสะสมเครื่องรางของขลังให้ความสนใจในการนำมาแกะรูปพระราหูหรือเทพเจ้าแห่งเครื่องรางของขลัง เพื่อบูชาและสวมใส่ นับเป็นของมีค่า หรือผลิตจากวัสดุพลาสติกมาตรฐาน คุณภาพสูง ปลอดภัย เหมาะสำหรับการตวงข้าวหรือของแห้งต่างๆ
			"
        ));	
		array_push($data, array(
			'id' => 13, "tools"=>"Thappi",  "caption" => "ทัพพี", "position" => "-10 10 100",
			"content" => "<p>ทัพพี หรือ จวัก ธรรมดาสามัญว่า กระจ่า ชาวบ้านบางคนก็เรียกว่า ตวัก สมัยโบราณก็มีข้อห้ามไม่ให้ใช้จวักตักชิม ซึ่งเป็นความเชื่อของคนโบราณ เป็นของใช้พื้นบ้านมาตั้งแต่โบราณชาวบ้านชาวเมืองใช้กันอยู่ทั่วไป แต่ในรั้ววัง พวกทำ เครื่องต้น และเครื่องเสวยของเจ้านายหรือขุนนางผู้มีบรรดาศักดิ์สูงเลิกใช้ไปแล้ว วัสดุทำกะลามะพร้าวแก่ๆ มาตัดให้เป็นรูปค่อนข้างกลม แล้วทำด้ามสำหรับถือยาวๆ ใช้สำหรับตักอาหารจากหม้อหรือภาชนะ ใช้สำหรับตักข้าว ตักแกง ตักของหวาน 
			<p>ปัจจุบัน นิยมใช้ไม้และโลหะในการทำทัพพี พลาสติก แก้ว ซิลิโคลนและสแตนเลส คุณภาพสูง มีความแข็งแรง ทนทาน น้ำหนักเบา จับถนัดมือ ทำความสะอาดและดูแลรักษาง่าย ปกติใช้ตักข้าว ตักแกง ตักอาหาร แต่ทัพพีในหลายวัฒนธรรมการกิน มีประโยชน์มากกว่านั้น เช่น ในญี่ปุ่นใช้ทัพพีใช้คนข้าวซูชิให้แยกเม็ดกัน เป็นต้น
			"
        ));	
		array_push($data, array(
			'id' => 14, "tools"=>"Tray",  "caption" => "ถาด", "ถาดสังกะสี" => "0 0 10",
			"content" => "<p>ถาดสังกะสี หรือ อีนาเมล เป็นถาดที่ทำจากเหล็กเคลือบด้วยอีนาเมลสีสวยงาม และไม่เป็นอันตราย สิ่งที่เคลือบอยู่ไม่ใช่สีธรรมดาๆ แต่เป็นการเคลือบอีนาเมล (enamel coating) เป็นการเคลือบแก้วลงไปบนภาชนะ เพื่อให้ภาชนะนั้นๆ ทำความสะอาดง่าย ทนต่อความร้อน กรด ด่าง และปลอดภัยจากการปนเปื้อนของเนื้อภาชนะโลหะ การเคลือบอีนาเมล ภาชนะแบบนี้เป็นที่นิยมเพราะรูปร่างและสีสันที่ดูเก่าๆ คลาสสิก แบบที่หลายคนนิยามว่าเป็นสไตล์แอนทีค  ถาดทั่วไปนิยมใส่ของไหว้ เวลาไปทำบุญ ญาติโยมก็จะตักกับข้าวออกจากปิ่นโตใส่ถ้วยเล็กๆ เพื่อเตรียมประเคนให้พระฉัน เน้นสีแดงสีส้มสดใส มีลายเขียว น้ำเงิน แต่เคลือบด้วยสีขาวขอบน้ำเงิน หรือสีครีมขอบเขียว 
			<p>ถาดสมัยปัจจุบัน นิยมผลิตจาก กระดาษทำจากวัสดุธรรมชาติมีหลายชนิดและหลายรูปแบบ  เพราะผลิตจากกระดาษเคลือบ PE 2 ด้าน เป็นบรรจุภัณฑ์อาหารที่มีความคงทนและปลอดภัย สามารถสัมผัสอาหารได้โดยตรง มีทั้งสีขาวและลวดลายตามที่ผู้ประกอบการออกแบบ เช่น ถาดกระดาษ ลายไทย เป็นต้น , ถาดอาหารชีวภาพ PLA (Polylactic acid) เป็นถาดอาหารชีวภาพที่ผลิตจากพืช (Renewable resource) และสามารถย่อยสลายได้ 100% เพื่อทดแทนการใช้ถาดพลาสติกใส PET (Polyethylene terephthalate) ซึ่งเป็นพลาสติกที่ผลิตจากปิโตรเลียมและไม่สามารถย่อยสลายเองได้ทางชีวภาพ ซึ่งเมื่อเทียบเม็ดพลาสติกสำหรับขึ้นรูปถาดของ PLA กับ PET พบว่า เม็ดพลาสติก PLA จะปล่อยคาร์บอนฟุตพริ้นน้อยกว่าเม็ดพลาสติก PET ถึง 82% เหมาะสำหรับร้านอาหาร ร้านขนมคาเฟ่ ร้านเครื่องดื่มที่ขายขนมอบกรอบและเบเกอรี่ หรือใช้ในงานออกบูธสำหรับธุรกิจขายสินค้าประเภทของกิน
		"
        ));	
		array_push($data, array(
			'id' => 15, "tools"=>"TreshingBasket",  "caption" => "กระด้ง", "position" => "0 0 20",
			"content" => "<p>กระด้ง กระด้งหรือที่เรียกติดปากว่าด้ง ในอดีตเป็นเครื่องจักสานรูปไม้ไผ่รูปกลม มีขอบ ตัวตะแกรงสานด้วยดอกไม้ไผ่เป็นตาห่างๆ นิยมใช้กันอยู่ในภาคใต้มี ๒ อย่าง คือ กระด้งฝัดข้าว และกระด้งมอน กระด้งฝัดข้าวของภาคใต้มี ๒ ชนิดคือ กระด้งลายขอ สานด้วยตอกไม้ไผ่สีสุก เพราะเป็นไม้ไผ่ที่มีเนื้อแข็งและเหนียว รูปแบบและโครงสร้างของกระด้งลายขอที่มีลักษณะเฉพาะที่สนองความต้องการในการใช้สอยได้ดี และ กระด้งบองหยอง ใช้ตอกไม้ไผ่เช่นเดียวกับกระด้งลายขอ แต่ใช้ตอกเส้นใหญ่กว่าและไม่มีข้อปล้อง กระด้งทั้งสองชนิดนี้สานด้วยไม้ไผ่และหวายสำหรับใช้งานเกษตรกรรม โดยเฉพาะการทำไร่ทำนา ฝัดข้าว  หรือใช้เป็นภาชนะในการตากปลา ตากเนื้อ ตากพริก และอื่นๆที่ต้องการตากแห้ง 
			<p>แต่ปัจจุบันนิยมใช้พลาสติกมากขึ้น ซึ่งผลิตจากเมล็ดพลาสติกคุณภาพสูง เพราะราคาประหยัด มีความแข็งแรง ใช้งานได้ดี ไม่ต้องกลัว แมลงหรือมอด สามารถล้างน้ำได้ ไม่ต้องกลัวเลอะ ลวดลายสานเหมาะกับการใช้งาน เช่น ตากปลา ใส่อาหาร สิ่งของ รองกระถางดอกไม้ ถาดรองอาหาร 
			"
        ));					
		return $this->output
            ->set_status_header(200)
            ->set_output(json_encode($data));
    }

	
}
